Repository: common-repository/trusted-accounts
Catalog: languages/trusted-accounts-*.po
Languages: de_de

source: Trusted Accounts: Get abusive user accounts under control
de_de: Trusted Accounts: Bekommen Sie missbräuchliche Nutzer- Accounts unter Kontrolle

source: Stop harmful users from creating multiple accounts and protect your platform from fraud, spam and abuse.
de_de: Verhindern Sie, dass schädliche Nutzer mehrere Konten anlegen, und schützen Sie Ihre Plattform vor Betrug, Spam und Missbrauch.

source: User Verification Details
de_de: Benutzerverifikation Details

source: Validated email
de_de: Validierte E-Mail

source: Verified
de_de: Verifiziert

source: Verification Level
de_de: Verifikations-Level

source: Phone Country Code
de_de: Telefon Landesvorwahl

source: Unique Browser Fingerprint
de_de: Einzigartiger Browser Fingerprint

source: Email valid
de_de: Email valide

source: More user details
de_de: Mehr User-Details

source: Show user details
de_de: User-Details anzeigen

source: Remove verification
de_de: Verifikation entfernen

source: When you remove the verification this user will be able to verify another account with the same Trusted Account or phone number.
de_de: Wenn Sie die Verifizierung aufheben, kann dieser Benutzer ein anderes Konto mit demselben Trusted Account oder derselben Telefonnummer verifizieren.

source: Account Verification (by Trusted Accounts)
de_de: Account-Verifizierung (mit Trusted Accounts)

source: Login with Trusted
de_de: Mit Trusted anmelden

source: Enable "Login with Trusted" for this account
de_de: Aktiviere "Login mit Trusted" für diesen Account

source: Blocked
de_de: Blockiert

source: With Trusted you can login and verify while remaining anonymous.
de_de: Mit Trusted kannst du dich anmelden und verifizieren, und dabei anonym bleiben.

source: OR
de_de: ODER

source: Register with Trusted
de_de: Mit Trusted registrieren

source: With Trusted you can register and verify while remaining anonymous.
de_de: Mit Trusted kannst du dich registrieren und verifizieren, und dabei anonym bleiben.

source: Verify with Trusted
de_de: Mit Trusted verifizieren

source: Prove you are real and unique while remaining anonymous.
de_de: Zeige, dass du ein echter Mensch bist und bleibe dabei anonym.

source: Please prove you are human to comment on this post. It will take less than a minute.
de_de: Bitte zeigen Sie, dass Sie ein Mensch sind, um diesen Beitrag zu kommentieren.

source: I am human
de_de: Ich bin ein Mensch

source: Successfully saved the configuration.
de_de: Die Einstellung wurde erfolgreich gespeichert.

source: Your account has been blocked on this platform.
de_de: Dein Trusted Account wurde auf dieser Plattform gesperrt.

source: Go back
de_de: Zurück

source: This Trusted Account has already been used to verify an account on this platform. You can only verify one account per Trusted Account.
de_de: Dieser Trusted Account wurde bereits zur Verifizierung eines Kontos auf dieser Plattform verwendet. Du kannst nur ein Konto pro Trusted Account verifizieren.

source: This Trusted Account is verified, but does not have the "Login with Trusted" activated. Please use another login method.
de_de: Dieser Trusted Account ist verifiziert, aber die Option "Login mit Trusted" ist nicht aktiviert. Bitte verwende eine andere Anmeldemethode.

source: Verified with Trusted
de_de: Mit Trusted verifiziert

source: Reply to this comment
de_de: Antworte auf diesen Kommentar

source: Verify to reply
de_de: Verifizieren um zu antworten

source: Settings successfully saved. You are all set.
de_de: Einstellungen erfolgreich gespeichert. Du bist startklar.

source: This username already exists on this platform.
de_de: Dieser Username existiert bereits auf dieser Plattform.

source: This email already exists on this platform.
de_de: Diese Email-Adresse existiert bereits auf dieser Plattform.

source: Please provide an email address.
de_de: Bitte gib eine Email an.

source: Please provide a username.
de_de: Bitte gib einen Usernamen an.

source: This platform requires at least an email address.
de_de: Diese Plattform benötigt zumindest eine Email-Adresse.

source: Setup profile
de_de: Profil einrichten

source: Choose what information you want to share with this platform or just skip.
de_de: Wähle aus, welche Informationen du mit dieser Plattform teilen möchtest.

source: Verified & anonymous
de_de: Verifiziert & anonym

source: You have successfully registered and verified your anonymous account.
de_de: Du hast dich erfolgreich registriert. Dein anonymer Account wurde verifiziert.

source: Save
de_de: Speichern

source: Skip
de_de: Überspringen
